Revit 2027 API
BuiltInFailures.AssemblyFailures.DeleteAssemblyInstWithViewsWarn Property
 Deleting this assembly will remove the assembly from the project and any views associated with that assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteAssemblyInstWithViewsWarn { get; }
Public Shared ReadOnly Property DeleteAssemblyInstWithViewsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteAssemblyInstWithViewsWarn {
	FailureDefinitionId^ get ();
}
static member DeleteAssemblyInstWithViewsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace